tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "bat"
brew "btop"
brew "colima"
brew "docker"
brew "eza"
brew "fastfetch"
brew "fzf"
brew "git-lfs"
brew "hyperfine"
brew "jq"
brew "lazygit"
brew "neovim"
brew "node"
brew "nushell"
brew "pueue"
brew "starship"
brew "trash-cli"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alt-tab"
cask "kitty"
cask "raycast"
