tap "b3z/small"
tap "felixkratz/formulae"
tap "ferdium/ferdium"
tap "fsouza/prettierd"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "romkatv/powerlevel10k"
tap "smokris/getwindowid"
tap "supabase/tap"
brew "libpng"
brew "glib"
brew "xz"
brew "zstd"
brew "libtiff"
brew "adwaita-icon-theme"
brew "imath"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "dbus"
brew "atkmm@2.28"
brew "libssh2"
brew "bat"
brew "brightness"
brew "gcc"
brew "btop"
brew "cmake"
brew "defaultbrowser"
brew "dos2unix"
brew "eza"
brew "fastfetch"
brew "unbound"
brew "lame"
brew "openjpeg"
brew "leptonica"
brew "libarchive"
brew "opus"
brew "libsodium"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "sqlite"
brew "python@3.12"
brew "gallery-dl"
brew "gh"
brew "ghostscript"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg@2.2"
brew "go"
brew "gradle"
brew "gtkmm3"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "ldid"
brew "libhandy"
brew "python@3.11"
brew "lsusb"
brew "mpv"
brew "mysql"
brew "ncdu"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "ninja"
brew "nlohmann-json"
brew "node"
brew "nushell"
brew "nvm"
brew "oha"
brew "onefetch"
brew "openssl@1.1"
brew "php"
brew "portaudio"
brew "powerlevel10k"
brew "ranger"
brew "rust"
brew "rustup-init"
brew "scc"
brew "scons"
brew "spdlog"
brew "speedtest-cli"
brew "spotify_player"
brew "spotifyd"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "telnet"
brew "terminal-notifier"
brew "tldr"
brew "transmission-cli"
brew "trash-cli"
brew "tty-clock"
brew "wget"
brew "wimlib"
brew "yarn"
brew "yazi"
brew "zig"
brew "zoxide"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "fsouza/prettierd/prettierd"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "smokris/getwindowid/getwindowid"
brew "supabase/tap/supabase"
cask "accord"
cask "anytype"
cask "chromium"
cask "easy-move-plus-resize"
cask "ferdium"
cask "font-monocraft"
cask "kitty"
cask "phoenix"
cask "pomotroid"
cask "raycast"
cask "sf-symbols"
cask "steamcmd"
vscode "1yib.rust-bundle"
vscode "1yib.svelte-bundle"
vscode "aaron-bond.better-comments"
vscode "alfredbirk.tailwind-documentation"
vscode "andenetalexander.vim-cheatsheet"
vscode "antfu.goto-alias"
vscode "antfu.iconify"
vscode "arcensoth.language-mcfunction"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "atomiks.moonlight"
vscode "austenc.tailwind-docs"
vscode "bcakyz.vue-packs"
vscode "bierner.markdown-preview-github-styles"
vscode "blair-c.tailwind-to-css-snippets"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "christopheranthonycastanuela.tab-jumper"
vscode "cpreston321.nuxt-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "drcika.apc-extension"
vscode "dunstontc.viml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "fivethree.vscode-svelte-snippets"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gregorbiswanger.json2ts"
vscode "helgardrichard.helium-icon-theme"
vscode "hollowtree.vue-snippets"
vscode "janisdd.vscode-edit-csv"
vscode "jannchie.codetime"
vscode "jbockle.jbockle-format-files"
vscode "jinxdash.prettier-rust"
vscode "kevinrose.vsc-python-indent"
vscode "leetcode.vscode-leetcode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "minecraftcommands.syntax-mcfunction"
vscode "mohammadmd.vscode-sassc"
vscode "moyu.snapcode"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "nuxt.mdc"
vscode "oderwat.indent-rainbow"
vscode "phplasma.csv-to-table"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "softwaredotcom.swdc-vscode"
vscode "spgoding.datapack-language-server"
vscode "stivo.tailwind-fold"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "vue.vscode-typescript-vue-plugin"
vscode "willjleong.nuxt-typescript-snippets"
vscode "wscats.eno"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhouronghui.propertylist"
vscode "ziglang.vscode-zig"
vscode "zignd.html-css-class-completion"
vscode "znck.vue"
