tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "bat"
brew "btop"
brew "colima"
brew "docker"
brew "eza"
brew "fastfetch"
brew "fzf"
brew "git-lfs"
brew "hyperfine"
brew "jq"
brew "lazygit"
brew "neovim"
brew "node"
brew "nushell"
brew "pueue"
brew "starship"
brew "trash-cli"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alt-tab"
cask "kitty"
cask "raycast"
vscode "1yib.rust-bundle"
vscode "1yib.svelte-bundle"
vscode "aaron-bond.better-comments"
vscode "alfredbirk.tailwind-documentation"
vscode "andenetalexander.vim-cheatsheet"
vscode "antfu.goto-alias"
vscode "antfu.iconify"
vscode "arcensoth.language-mcfunction"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "atomiks.moonlight"
vscode "austenc.tailwind-docs"
vscode "bbenoist.nix"
vscode "bcakyz.vue-packs"
vscode "bierner.markdown-preview-github-styles"
vscode "blair-c.tailwind-to-css-snippets"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "christopheranthonycastanuela.tab-jumper"
vscode "cpreston321.nuxt-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "drcika.apc-extension"
vscode "dunstontc.viml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "fivethree.vscode-svelte-snippets"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gregorbiswanger.json2ts"
vscode "helgardrichard.helium-icon-theme"
vscode "hollowtree.vue-snippets"
vscode "janisdd.vscode-edit-csv"
vscode "jannchie.codetime"
vscode "jbockle.jbockle-format-files"
vscode "jinxdash.prettier-rust"
vscode "kevinrose.vsc-python-indent"
vscode "leetcode.vscode-leetcode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "minecraftcommands.syntax-mcfunction"
vscode "mohammadmd.vscode-sassc"
vscode "moyu.snapcode"
vscode "ms-python.autopep8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "mwpb.java-prettier-formatter"
vscode "naumovs.color-highlight"
vscode "nuxt.mdc"
vscode "oderwat.indent-rainbow"
vscode "phplasma.csv-to-table"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "softwaredotcom.swdc-vscode"
vscode "spgoding.datapack-language-server"
vscode "stivo.tailwind-fold"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "vue.volar"
vscode "willjleong.nuxt-typescript-snippets"
vscode "wscats.eno"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhouronghui.propertylist"
vscode "ziglang.vscode-zig"
vscode "zignd.html-css-class-completion"
vscode "znck.vue"
